using UnityEngine;
using System.Collections;

public class MainProcess : MonoBehaviour
{

    public AudioSource titleMusic = null;
    public GameObject title = null;
    public GameObject MainCamera = null;
    private string processState = "";
    public float actionTime = 0.0f;
    private int score = 0;

    //*********************************************************************************************************************************************************

    //*********************************************************************************************************************************************************

    void Start()
    {

        //隱藏鼠標
        actionTime = 0;
        processState = "Initial state";     //遊戲過程狀態為"初始狀態"
    }

    //*********************************************************************************************************************************************************

    //*********************************************************************************************************************************************************

    void Update()
    {
        if (processState == "Initial state")        //當遊戲過程狀態是"初始狀態"	
        {

            score = title.GetComponent<Button>().count;
            if (titleMusic.isPlaying == false)      //如果主題音樂播放是關的，播放主題音樂
            {
                titleMusic.Play();
            }

            if (score == 1)    //當按下滑鼠左鍵，將攝影機動畫狀態切換為"介紹畫面"，傳送"白天變晚上"的訊息，停止標題音樂，改放介紹音樂，actionTime = 0，遊戲過程狀態切換為"介紹狀態"
            {
                //停止標題的音樂

                Application.LoadLevel("main1");

            }
        }

        //---------------------------------------------------------------------------------------------------------------------------------------------------------

    }
}
	//*********************************************************************************************************************************************************

	//*********************************************************************************************************************************************************

	